Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/financial_services/financial_products/protection_of_consumers_of_financial_services.html.txt.tmx
Source language: en
Languages: ga

source: There are also laws that deal with unsolicited commercial email which can help to ensure that your personal details remain private
ga: Tá dlíthe ann freisin a dhéileáileann le ríomhphoist thráchtála gan iarraidh ar féidir leo cinntiú go bhfanann do shonraí pearsanta príomhaideach
